In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\ethereal\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\ethereal\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\ethereal\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\ethereal\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\ethereal\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\ethereal\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd

# Introduction to Series

- Series is one dimensional.

In [13]:
vowel = ['a','e','i','o','u']
s = pd.Series(vowel)

In [14]:
type(s)

pandas.core.series.Series

In [15]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [19]:
s.index.tolist()

[0, 1, 2, 3, 4]

In [20]:
s.values

array(['a', 'e', 'i', 'o', 'u'], dtype=object)

In [21]:
s[2]

'i'

In [22]:
s.values

array(['a', 'e', 'i', 'o', 'u'], dtype=object)

In [23]:
s.values[2]

'i'

In [24]:
s[3]

'o'

In [25]:
s.values[3]

'o'

In [33]:
vowel = ['a','e','i','o','u']
s = pd.Series(vowel, index = [101,102,103,104,105])

In [27]:
s

101    a
102    e
103    i
104    o
105    u
dtype: object

In [29]:
s[104]

'o'

In [30]:
s.values[2]

'i'

In [34]:
s = pd.Series(['Taylor','Pragya','Rojina',])

In [40]:
s1 = pd.Series(['Taylor','Pragya','Rojina'],name = 'Students_Name')
s2 = pd.Series([1,6,5],name = 'semester')

In [41]:
df = pd.concat([s1,s2],axis = 'columns')
df

  Students_Name  semester
0        Taylor         1
1        Pragya         6
2        Rojina         5

In [42]:
dir

In [43]:
df = pd.read_csv('penguins.csv')

In [46]:
df.head(10)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,FEMALE
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,MALE
8,Adelie,Torgersen,34.1,18.1,193.0,3475.0,NaN
9,Adelie,Torgersen,42.0,20.2,190.0,4250.0,NaN

In [45]:
df.tail()

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [56]:
df[df['species']=='Gentoo'].head(5)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
220,Gentoo,Biscoe,46.1,13.2,211.0,4500.0,FEMALE
221,Gentoo,Biscoe,50.0,16.3,230.0,5700.0,MALE
222,Gentoo,Biscoe,48.7,14.1,210.0,4450.0,FEMALE
223,Gentoo,Biscoe,50.0,15.2,218.0,5700.0,MALE
224,Gentoo,Biscoe,47.6,14.5,215.0,5400.0,MALE

In [57]:
df.shape #Number of rows and columns

(344, 7)

In [59]:
df.columns.tolist() #Headings name

['species',
 'island',
 'bill_length_mm',
 'bill_depth_mm',
 'flipper_length_mm',
 'body_mass_g',
 'sex']

In [61]:
df.sample(3)  #random sample

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
59,Adelie,Biscoe,37.6,19.1,194.0,3750.0,MALE
231,Gentoo,Biscoe,49.0,16.1,216.0,5550.0,MALE
186,Chinstrap,Dream,49.7,18.6,195.0,3600.0,MALE

In [63]:
df.sample(3, random_state=2024)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
161,Chinstrap,Dream,51.3,19.9,198.0,3700.0,MALE
318,Gentoo,Biscoe,48.4,14.4,203.0,4625.0,FEMALE
85,Adelie,Dream,41.3,20.3,194.0,3550.0,MALE

In [64]:
df.describe()

       bill_length_mm  bill_depth_mm  flipper_length_mm  body_mass_g
count      342.000000     342.000000         342.000000   342.000000
mean        43.921930      17.151170         200.915205  4201.754386
std          5.459584       1.974793          14.061714   801.954536
min         32.100000      13.100000         172.000000  2700.000000
25%         39.225000      15.600000         190.000000  3550.000000
50%         44.450000      17.300000         197.000000  4050.000000
75%         48.500000      18.700000         213.000000  4750.000000
max         59.600000      21.500000         231.000000  6300.000000

In [65]:
df.describe(include = 'object')

       species  island   sex
count      344     344   333
unique       3       3     2
top     Adelie  Biscoe  MALE
freq       152     168   168

In [66]:
df['species'] #accessing column of dataframe

0      Adelie
1      Adelie
2      Adelie
3      Adelie
4      Adelie
        ...
339    Gentoo
340    Gentoo
341    Gentoo
342    Gentoo
343    Gentoo
Name: species, Length: 344, dtype: object

In [67]:
type(df['species'])

pandas.core.series.Series

In [68]:
df['species'].unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [69]:
df['species'].nunique() #Number of unique occurences in species

3

In [70]:
df['species'].value_counts()

species
Adelie       152
Gentoo       124
Chinstrap     68
Name: count, dtype: int64

In [71]:
df.island.unique()

array(['Torgersen', 'Biscoe', 'Dream'], dtype=object)

In [72]:
df.species.unique()

array(['Adelie', 'Chinstrap', 'Gentoo'], dtype=object)

In [74]:
df['sex'].unique()

array(['MALE', 'FEMALE', nan], dtype=object)

In [75]:
df['sex'].nunique()

2

In [76]:
df.sort_values(by= ['body_mass_g']) # ascending order

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,FEMALE
64,Adelie,Biscoe,36.4,17.1,184.0,2850.0,FEMALE
58,Adelie,Biscoe,36.5,16.6,181.0,2850.0,FEMALE
116,Adelie,Torgersen,38.6,17.0,188.0,2900.0,FEMALE
98,Adelie,Dream,33.1,16.1,178.0,2900.0,FEMALE
...,...,...,...,...,...,...,...
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
237,Gentoo,Biscoe,49.2,15.2,221.0,6300.0,MALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [77]:
df.sort_values(by= ['body_mass_g'], ascending = False) # descending order

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
237,Gentoo,Biscoe,49.2,15.2,221.0,6300.0,MALE
253,Gentoo,Biscoe,59.6,17.0,230.0,6050.0,MALE
297,Gentoo,Biscoe,51.1,16.3,220.0,6000.0,MALE
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
331,Gentoo,Biscoe,49.8,15.9,229.0,5950.0,MALE
...,...,...,...,...,...,...,...
58,Adelie,Biscoe,36.5,16.6,181.0,2850.0,FEMALE
64,Adelie,Biscoe,36.4,17.1,184.0,2850.0,FEMALE
190,Chinstrap,Dream,46.9,16.6,192.0,2700.0,FEMALE
3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN
339,Gentoo,Biscoe,NaN,NaN,NaN,NaN,NaN

In [79]:
df['sex']== 'MALE'

0       True
1      False
2      False
3      False
4      False
       ...
339    False
340    False
341     True
342    False
343     True
Name: sex, Length: 344, dtype: bool

In [82]:
df.loc[df['sex']== 'MALE']

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,MALE
5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,MALE
7,Adelie,Torgersen,39.2,19.6,195.0,4675.0,MALE
13,Adelie,Torgersen,38.6,21.2,191.0,3800.0,MALE
14,Adelie,Torgersen,34.6,21.1,198.0,4400.0,MALE
...,...,...,...,...,...,...,...
333,Gentoo,Biscoe,51.5,16.3,230.0,5500.0,MALE
335,Gentoo,Biscoe,55.1,16.0,230.0,5850.0,MALE
337,Gentoo,Biscoe,48.8,16.2,222.0,6000.0,MALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [84]:
df.loc[df['sex']== 'FEMALE']

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,FEMALE
4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,FEMALE
6,Adelie,Torgersen,38.9,17.8,181.0,3625.0,FEMALE
12,Adelie,Torgersen,41.1,17.6,182.0,3200.0,FEMALE
...,...,...,...,...,...,...,...
332,Gentoo,Biscoe,43.5,15.2,213.0,4650.0,FEMALE
334,Gentoo,Biscoe,46.2,14.1,217.0,4375.0,FEMALE
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE

In [85]:
df.loc[df.sex == 'FEMALE']['body_mass_g'].mean()

3862.2727272727275

In [86]:
df.loc[df.sex == 'MALE']['body_mass_g'].mean()

4545.684523809524

In [87]:
df.loc[df.sex == 'FEMALE']['flipper_length_mm'].mean()

197.36363636363637

In [88]:
df.loc[df.sex == 'MALE']['flipper_length_mm'].mean()

204.50595238095238

In [89]:
df.groupby(['sex'])['flipper_length_mm'].mean()

sex
FEMALE    197.363636
MALE      204.505952
Name: flipper_length_mm, dtype: float64

In [91]:
df.groupby(['species'])['flipper_length_mm'].mean() #Which species flipper length is longest in average?

species
Adelie       189.953642
Chinstrap    195.823529
Gentoo       217.186992
Name: flipper_length_mm, dtype: float64

In [92]:
df.groupby(['species','sex'])['flipper_length_mm'].mean()

species    sex
Adelie     FEMALE    187.794521
           MALE      192.410959
Chinstrap  FEMALE    191.735294
           MALE      199.911765
Gentoo     FEMALE    212.706897
           MALE      221.540984
Name: flipper_length_mm, dtype: float64

# loc vs iloc

In [93]:
df.sample(3)

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
137,Adelie,Dream,40.2,20.1,200.0,3975.0,MALE
93,Adelie,Dream,39.6,18.1,186.0,4450.0,MALE
36,Adelie,Dream,38.8,20.0,190.0,3950.0,MALE

In [94]:
df.loc[25:30,['species','island']]

   species  island
25  Adelie  Biscoe
26  Adelie  Biscoe
27  Adelie  Biscoe
28  Adelie  Biscoe
29  Adelie  Biscoe
30  Adelie   Dream

# iloc

In [100]:
df.iloc[25:30,:2]

   species  island
25  Adelie  Biscoe
26  Adelie  Biscoe
27  Adelie  Biscoe
28  Adelie  Biscoe
29  Adelie  Biscoe

In [102]:
df.iloc[25:30,-2:]

    body_mass_g     sex
25       3800.0  FEMALE
26       3550.0    MALE
27       3200.0  FEMALE
28       3150.0  FEMALE
29       3950.0    MALE

In [104]:
# flipper length should be greater than 200 mm by data slicing

df.loc[df['flipper_length_mm']>200]

,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex
90,Adelie,Dream,35.7,18.0,202.0,3550.0,FEMALE
91,Adelie,Dream,41.1,18.1,205.0,4300.0,MALE
95,Adelie,Dream,40.8,18.9,208.0,4300.0,MALE
101,Adelie,Biscoe,41.0,20.0,203.0,4725.0,MALE
123,Adelie,Torgersen,41.4,18.5,202.0,3875.0,MALE
...,...,...,...,...,...,...,...
338,Gentoo,Biscoe,47.2,13.7,214.0,4925.0,FEMALE
340,Gentoo,Biscoe,46.8,14.3,215.0,4850.0,FEMALE
341,Gentoo,Biscoe,50.4,15.7,222.0,5750.0,MALE
342,Gentoo,Biscoe,45.2,14.8,212.0,5200.0,FEMALE
343,Gentoo,Biscoe,49.9,16.1,213.0,5400.0,MALE

In [105]:
# Try tips.csv